Model summary for bidirectional LSTM and attention network: 
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, 500)]        0
__________________________________________________________________________________________________
embedding (Embedding)           (None, 500, 200)     4319000     input_1[0][0]
__________________________________________________________________________________________________
lstm (LSTM)                     (None, 500, 32)      29824       embedding[0][0]
__________________________________________________________________________________________________
dense (Dense)                   (None, 500, 1)       33          lstm[0][0]
__________________________________________________________________________________________________
flatten (Flatten)               (None, 500)          0           dense[0][0]
__________________________________________________________________________________________________
activation (Activation)         (None, 500)          0           flatten[0][0]
__________________________________________________________________________________________________
repeat_vector (RepeatVector)    (None, 32, 500)      0           activation[0][0]
__________________________________________________________________________________________________
permute (Permute)               (None, 500, 32)      0           repeat_vector[0][0]
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 500, 64)      0           permute[0][0]
                                                                 lstm[0][0]
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, 32)           12416       concatenate[0][0]
__________________________________________________________________________________________________
output (Dense)                  (None, 2)            66          lstm_1[0][0]
==================================================================================================
Total params: 4,361,339
Trainable params: 42,339
Non-trainable params: 4,319,000
__________________________________________________________________________________________________

Model summary for bidirectional GRU and attention network: 
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, 500)]        0
__________________________________________________________________________________________________
embedding (Embedding)           (None, 500, 200)     8059600     input_1[0][0]
__________________________________________________________________________________________________
bidirectional (Bidirectional)   (None, 500, 64)      44736       embedding[0][0]
__________________________________________________________________________________________________
dense (Dense)                   (None, 500, 1)       65          bidirectional[0][0]
__________________________________________________________________________________________________
flatten (Flatten)               (None, 500)          0           dense[0][0]
__________________________________________________________________________________________________
activation (Activation)         (None, 500)          0           flatten[0][0]
__________________________________________________________________________________________________
repeat_vector (RepeatVector)    (None, 32, 500)      0           activation[0][0]
__________________________________________________________________________________________________
permute (Permute)               (None, 500, 32)      0           repeat_vector[0][0]
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 500, 96)      0           permute[0][0]
                                                                 bidirectional[0][0]
__________________________________________________________________________________________________
lstm (GRU)                     (None, 32)           16512       concatenate[0][0]
__________________________________________________________________________________________________
output (Dense)                  (None, 2)            66          lstm[0][0]
==================================================================================================
Total params: 8,120,979
Trainable params: 61,379
Non-trainable params: 8,059,600
__________________________________________________________________________________________________
None