Model summary for: "cnn_base 1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
embedding (Embedding)        (None, 500, 200)          4319000   
_________________________________________________________________
conv1d (Conv1D)              (None, 500, 48)           28848
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 250, 48)           0
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 250, 96)           13920
_________________________________________________________________
global_average_pooling1d (Gl (None, 96)                0
_________________________________________________________________
flatten (Flatten)            (None, 96)                0
_________________________________________________________________
dense (Dense)                (None, 128)               12416
_________________________________________________________________
dense_1 (Dense)              (None, 2)                 258
=================================================================
Total params: 4,374,442
Trainable params: 4,374,442
Non-trainable params: 0
_________________________________________________________________


Model summary for: "cnn_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
embedding (Embedding)        (None, 500, 200)          4319000
_________________________________________________________________
dropout (Dropout)            (None, 500, 200)          0
_________________________________________________________________
conv1d (Conv1D)              (None, 250, 48)           28848
_________________________________________________________________
batch_normalization (BatchNo (None, 250, 48)           192
_________________________________________________________________
activation (Activation)      (None, 250, 48)           0
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 125, 48)           0
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 63, 96)            13920
_________________________________________________________________
batch_normalization_1 (Batch (None, 63, 96)            384
_________________________________________________________________
activation_1 (Activation)    (None, 63, 96)            0
_________________________________________________________________
global_average_pooling1d (Gl (None, 96)                0
_________________________________________________________________
flatten (Flatten)            (None, 96)                0
_________________________________________________________________
dense (Dense)                (None, 128)               12416
_________________________________________________________________
dropout_1 (Dropout)          (None, 128)               0
_________________________________________________________________
dense_1 (Dense)              (None, 2)                 258
=================================================================
Total params: 4,375,018
Trainable params: 4,374,730
Non-trainable params: 288
_________________________________________________________________


Model summary for: "cnn_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
embedding (Embedding)        (None, 500, 200)          4319000
_________________________________________________________________
dropout (Dropout)            (None, 500, 200)          0
_________________________________________________________________
conv1d (Conv1D)              (None, 250, 48)           28848
_________________________________________________________________
batch_normalization (BatchNo (None, 250, 48)           192
_________________________________________________________________
activation (Activation)      (None, 250, 48)           0
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 250, 24)           1176
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 125, 24)           0
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 63, 96)            7008
_________________________________________________________________
batch_normalization_1 (Batch (None, 63, 96)            384
_________________________________________________________________
activation_1 (Activation)    (None, 63, 96)            0
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 63, 48)            4656
_________________________________________________________________
global_average_pooling1d (Gl (None, 48)                0
_________________________________________________________________
flatten (Flatten)            (None, 48)                0
_________________________________________________________________
dense (Dense)                (None, 128)               6272
_________________________________________________________________
dropout_1 (Dropout)          (None, 128)               0
_________________________________________________________________
dense_1 (Dense)              (None, 2)                 258
=================================================================
Total params: 4,367,794
Trainable params: 4,367,506
Non-trainable params: 288
_________________________________________________________________