Model summary: 
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
embedding (Embedding)        (None, 500, 200)          4319000
_________________________________________________________________
dropout (Dropout)            (None, 500, 200)          0
_________________________________________________________________
conv1d (Conv1D)              (None, 500, 32)           19232
_________________________________________________________________
batch_normalization (BatchNo (None, 500, 32)           128
_________________________________________________________________
activation (Activation)      (None, 500, 32)           0
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 250, 32)           0
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 250, 64)           6208
_________________________________________________________________
batch_normalization_1 (Batch (None, 250, 64)           256
_________________________________________________________________
activation_1 (Activation)    (None, 250, 64)           0
_________________________________________________________________
global_average_pooling1d (Gl (None, 64)                0
_________________________________________________________________
flatten (Flatten)            (None, 64)                0
_________________________________________________________________
dense (Dense)                (None, 64)                4160
_________________________________________________________________
dropout_1 (Dropout)          (None, 64)                0
_________________________________________________________________
dense_1 (Dense)              (None, 2)                 130
=================================================================
Total params: 4,349,114
Trainable params: 4,348,922
Non-trainable params: 192
_________________________________________________________________
